# Напишите программу, в которой пользователь будет задавать две строки,
# программа определять количество вхождений одной строки в другой

a = input('введите первую строку:')
b = input('введите вторую строку:')

print(a.count(b))