#Написать функцию, аргументы имена сотрудников, возвращает словарь, 
# ключи — первые буквы имён, значения — списки, содержащие имена, 
# начинающиеся с соответствующей буквы.
# Например: in "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out: {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}


def CreatThesaurFromNameList(*lst):
    res = {}
    for i in sorted(lst):
        letter = i[0]
        if letter not in res:
            res[letter] = [i]
        else:
            res[letter] +=[i]
    return res

print(CreatThesaurFromNameList("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))